run_files/ucb_betas/1/ucb06/backGround/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset
    {
        type            overset;
	value		$internalField;
    }

    wing
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "(inlet|outlet|topAndBottom)"
    {
        type            calculated;
        value           uniform 0;
    }

}

// ************************************************************************* //
